Training dataset: ./ACIT4630_SemesterProject/training_images/FunieGanData/	size: 2907
Epochs: 20	Batch size: 150
Model: "FSRCNN"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         [(None, 100, 100, 1)]     0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 100, 100, 56)      1456      
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 100, 100, 12)      684       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 100, 100, 56)      728       
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 200, 200, 1)       4537      
=================================================================
Total params: 7,405
Trainable params: 7,405
Non-trainable params: 0
_________________________________________________________________
