Training dataset: ./training_images/funiegan/	size: 2907
Epochs: 20	Batch size: 32
Model: "FSRCNN"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 120, 120, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 120, 120, 56)      1456      
_________________________________________________________________
p_re_lu (PReLU)              (None, 120, 120, 56)      806400    
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 120, 120, 12)      684       
_________________________________________________________________
p_re_lu_1 (PReLU)            (None, 120, 120, 12)      172800    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 120, 120, 56)      728       
_________________________________________________________________
p_re_lu_2 (PReLU)            (None, 120, 120, 56)      806400    
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 240, 240, 1)       4537      
_________________________________________________________________
p_re_lu_3 (PReLU)            (None, 240, 240, 1)       57600     
=================================================================
Total params: 1,850,605
Trainable params: 1,850,605
Non-trainable params: 0
_________________________________________________________________
