Training dataset: images/CH1_frames/	size: 108
Epochs: 2000	Batch size: 32
Model: "FSRCNN"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 360, 360, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 360, 360, 56)      1456      
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 360, 360, 12)      684       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 360, 360, 56)      728       
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 720, 720, 1)       4537      
=================================================================
Total params: 7,405
Trainable params: 7,405
Non-trainable params: 0
_________________________________________________________________
