Training dataset: ./images/flowers/	size: 8189
Epochs: 500	Batch size: 32
Model: "FSRCNN"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 250, 250, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 250, 250, 56)      1456      
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 250, 250, 12)      684       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 250, 250, 56)      728       
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 500, 500, 1)       4537      
=================================================================
Total params: 7,405
Trainable params: 7,405
Non-trainable params: 0
_________________________________________________________________
