Training dataset: ./training_images/flowers/	size: 8189
Epochs: 500	Batch size: 64
Model: "FSRCNN"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 128, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 128, 128, 56)      1456      
_________________________________________________________________
tf.nn.relu (TFOpLambda)      (None, 128, 128, 56)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 128, 128, 12)      684       
_________________________________________________________________
tf.nn.relu_1 (TFOpLambda)    (None, 128, 128, 12)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 128, 12)      1308      
_________________________________________________________________
tf.nn.relu_2 (TFOpLambda)    (None, 128, 128, 12)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 128, 56)      728       
_________________________________________________________________
tf.nn.relu_3 (TFOpLambda)    (None, 128, 128, 56)      0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 256, 256, 1)       4537      
=================================================================
Total params: 8,713
Trainable params: 8,713
Non-trainable params: 0
_________________________________________________________________
